Revit 2027 API
ParameterTypeId.ConnectorInsideDiameter Property
 "Inside Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConnectorInsideDiameter { get; }
Public Shared ReadOnly Property ConnectorInsideDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConnectorInsideDiameter {
	ForgeTypeId^ get ();
}
static member ConnectorInsideDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace